Revit 2027 API
ParameterTypeId.TrussFamilyDiagWebStructuralTypesParam Property
 "Structural Framing Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId TrussFamilyDiagWebStructuralTypesParam { get; }
Public Shared ReadOnly Property TrussFamilyDiagWebStructuralTypesParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ TrussFamilyDiagWebStructuralTypesParam {
	ForgeTypeId^ get ();
}
static member TrussFamilyDiagWebStructuralTypesParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace